loadtests/artillery-edge-observer.yml
# Edge Observer REST API load test (read-only)
#
# Focuses on Edge-adjacent observer endpoints without creating/deleting Edge jobs.
#
# Usage:
#   docker compose -f docker/docker-compose.edge-loadtest.yml run --rm edge-observer
#
# Env vars:
#   BASE_URL                    http://backend:3051
#   DASHBOARD_USER              admin
#   DASHBOARD_PASS              changeme123
config:
  target: "{{ $processEnvironment.BASE_URL }}"
  processor: "./artillery-helpers.cjs"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 2
      name: "Warm-up"
    - duration: 90
      arrivalRate: 12
      name: "Sustained edge observer load"
    - duration: 10
      arrivalRate: 12
      rampTo: 1
      name: "Cool-down"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Edge observer flow"
    beforeScenario: "setToken"
    flow:
      - get:
          url: "/api/endpoints"
          headers:
            Authorization: "Bearer {{ token }}"

      - think: 1

      - get:
          url: "/api/endpoints/debug/edge-status"
          headers:
            Authorization: "Bearer {{ token }}"

      - think: 1

      - get:
          url: "/api/edge-jobs"
          headers:
            Authorization: "Bearer {{ token }}"